[
    {
        "id": 1,
        "title": "What do you mean by HTML5?",
        "price": 10.95,
        "description": "HTML stands for Hyper Text Markup Language. HTML is the standard markup language for creating Web pages. HTML describes the structure of a Web page. HTML consists of a series of elements. HTML elements tell the browser how to display the content. HTML elements label pieces of content etc.",
        "category": "HTML 5",
        "image": "https://www.optasy.com/static/html5-reasons-why-your-business-7eaf51b1efbac224a826255f61b1e827.png",
        "rating": {
          "rate": 4.9,
          "count": 110
        }
      },
    {
        "id": 2,
        "title": "What is CSS?",
        "price": 19.95,
        "description": "CSS stands for Cascading Style Sheets. CSS describes how HTML elements are to be displayed on screen, paper, or in other media. CSS saves a lot of work. It can control the layout of multiple web pages all at once. External stylesheets are stored in CSS files",
        "category": "CSS",
        "image": "https://cutewallpaper.org/24/css3-logo-png/11-best-freelance-css-developers-hire-in-48-hours-toptal%C2%AE.png",
        "rating": {
          "rate": 4.8,
          "count": 120
        }
      },
    {
        "id": 3,
        "title": "What is JavaScript?",
        "price": 10.5,
        "description": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. This article helps you get started with JavaScript and furthers your understanding of what is possible. JavaScript is versatile and beginner-friendly. With more experience, you'll be able to create games, animated 2D and 3D graphics, comprehensive database-driven apps, and much more!",
        "category": "javascript",
        "image": "https://www.pragimtech.com/wp-content/uploads/2019/03/java-script.jpg",
        "rating": {
          "rate": 4.4,
          "count": 130
        }
      },
    {
        "id": 4,
        "title": "What React?",
        "price": 29.5,
        "description": "Props stand for properties. Props are passed to components like function arguments. Props can be passed to components only via parent to child. Props data is immutable (read-only). A state can be modified based on user action or network changes. Every time the state of an object changes, React re-renders the component to the browser. The state object is initialized in the constructor. The state object can store multiple properties. this.setState() is used to change the value of the state object. setState() function performs a shallow merge between the new and the previous state",
        "category": "React Js",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQc2Y2gmQB5zuaBd1AfN_AyEgoTgxPF65i7GwlvrbnnP_RUlubieG19WFnonCtS4ZfAox4&usqp=CAU",
        "rating": {
          "rate": 4.5,
          "count": 140
        }
      },
    {
        "id": 5,
        "title": "What is Express Js?",
        "price": 39.9,
        "description": "Express is a minimal and flexible Node.js web application framework that provides a robust set of features to develop web and mobile applications. It facilitates the rapid development of Node based Web applications. Following are some of the core features of Express framework. Installing Express npm install express --save",
        "category": "Express Js",
        "image": "https://buttercms.com/static/images/tech_banners/ExpressJS.png",
        "rating": {
          "rate": 4.8,
          "count": 150
        }
      },
    {
        "id": 6,
        "title": "Learn MongoDB",
        "price": 49.5,
        "description": "Explain what a NoSQL database is. Describe the common types of NoSQL databases and their major features. Explain what MongoDB is and the advantages of using it. Articulate how a document-oriented database is structured and the way MongoDB stores data. Explain the importance of data modeling and the primary ways to model data in MongoDB. Create and use indexes in MongoDB to improve the efficiency of your queries. Explain the benefits and use cases of MongoDB Atlas, as well as set up your very own atlas cluster.",
        "category": "MongoDB",
        "image": "https://www.howtogeek.com/wp-content/uploads/csit/2021/07/f5932bc2.jpg?height=200p&trim=2,2,2,2",
        "rating": {
          "rate": 4.9,
          "count": 160
        }
      }

]